-- 名门
local famous = {}
setmetatable(famous, famous)
et.famous = famous

local mt = {}
famous.__index = mt

mt.id = 0
mt["攻击成长"] = 0
mt["防御成长"] = 0
mt["法力成长"] = 0

local function init()
    famous[1] = {["id"]= 1328558411, ["攻击成长"]= 400, ["防御成长"]= 20, ["法力成长"]= 600}
    famous[2] = {["id"]= 1429221424, ["攻击成长"]= 350, ["防御成长"]= 15, ["法力成长"]= 730}
    famous[3] = {["id"]= 1160786002, ["攻击成长"]= 260, ["防御成长"]= 12, ["法力成长"]= 540}
    famous[4] = {["id"]= 1211117633, ["攻击成长"]= 250, ["防御成长"]= 18, ["法力成长"]= 500}
    famous[5] = {["id"]= 1328558412, ["攻击成长"]= 310, ["防御成长"]= 16, ["法力成长"]= 750}
    famous[6] = {["id"]= 1328558413, ["攻击成长"]= 220, ["防御成长"]= 19, ["法力成长"]= 700}
    famous[7] = {["id"]= 1328558414, ["攻击成长"]= 340, ["防御成长"]= 17, ["法力成长"]= 640}
    famous[8] = {["id"]= 1160786003, ["攻击成长"]= 320, ["防御成长"]= 10, ["法力成长"]= 780}
    famous[9] = {["id"]= 1160786004, ["攻击成长"]= 200, ["防御成长"]= 12, ["法力成长"]= 550}
    famous[10] = {["id"]= 1311780913, ["攻击成长"]= 380, ["防御成长"]= 11, ["法力成长"]= 580}
    famous[11] = {["id"]= 1328558415, ["攻击成长"]= 280, ["防御成长"]= 14, ["法力成长"]= 800}
end

init()
return famous